{
  "architectures": [
    "EvaCLIPVisionModel"
  ],
  "attention_dropout": 0.0,
  "attn_drop": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_evaclip.EvaCLIPVisionConfig",
    "AutoModel": "modeling_eva.EvaCLIPWithDINOVisionModel"
  },
  "dropout": 0.0,
  "dynamic_image_size": 336,
  "fusedLN": true,
  "head_width": 64,
  "hidden_act": "gelu",
  "hidden_size": 1024,
  "fusion_hidden_size": 2048,
  "image_size": 336,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 2730,
  "intp_freq": true,
  "k_bias": true,
  "layer_norm_eps": 1e-06,
  "model_type": "clip_vision_model",
  "naiveswiglu": true,
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_heads": 64,
  "num_hidden_layers": 24,
  "patch_size": 14,
  "post_layernorm": false,
  "proj_drop": 0.0,
  "projection_dim": 768,
  "pt_hw_seq_len": 16,
  "q_bias": true,
  "qkv_bias": true,
  "rope": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "v_bias": true,
  "xattn": true,
  "dino_model_name": "/mnt/pfs-guan-ssai/cv/cjy/models/models--facebook--dinov2-large/snapshots/47b73eefe95e8d44ec3623f8890bd894b6ea2d6c"
}
