{
  "architectures": [
    "EvaCLIPVisionModel"
  ],
  "attention_dropout": 0.0,
  "attn_drop": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_evaclip.EvaCLIPVisionConfig",
    "AutoModel": "modeling_eva.EvaCLIPVisionModel"
  },
  "dropout": 0.0,
  "dynamic_image_size": 224,
  "fusedLN": true,
  "head_width": 64,
  "hidden_act": "gelu",
  "hidden_size": 768,
  "image_size": 224,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "intp_freq": true,
  "k_bias": true,
  "layer_norm_eps": 1e-06,
  "model_type": "clip_vision_model",
  "naiveswiglu": true,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_heads": 64,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "post_layernorm": false,
  "proj_drop": 0.0,
  "projection_dim": 768,
  "pt_hw_seq_len": 16,
  "q_bias": true,
  "qkv_bias": true,
  "rope": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "v_bias": true,
  "xattn": true
}
